app/controllers/registration_controller.rb

INSERT INTO "users" ("age", "attorney", "campaign", "consent", "created_at", "current_sign_in_at", "current_sign_in_ip", "debt", "desc", "email", "employment", "encrypted_password", "ip", "last_sign_in_at", "last_sign_in_ip", "lead", "loan", "medical", "name", "phone", "previous", "qualified", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "trusted", "updated_at", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29) RETURNING "id"
---
	def create
    if request.referer.to_s.downcase.include? "vinny"
      campaign = request.referer.split('.com/').last
    else
      campaign = "other"
    end
    if params["user"]["age"]
      age = params["user"]["age"]
    end
    if params["user"]["zipcode"]
      zipcode = params["user"]["zipcode"]
    end
    if params["xxTrustedFormCertUrl"]
      trusted = params["xxTrustedFormCertUrl"]
    end
    @user = User.create(:ip => request.remote_ip, :campaign => campaign, :age => age, :zipcode => zipcode, :trusted => trusted)